# inline_names
AD_GOTO = 'Перейти'
INLINE_TEXT = {
    'success': 'готово',
    'thumbUp': '👍',
    'thumbDown': '👎'
}
# commands.py
WELCOME = '''Шалом!
На мемасах не должно быть водных знаков(мы и так свой херачим, куда второй то)
Бот принимает только фото или видео(до 20мб.)
Обязательно иметь username в телеграме (Настройки->Изменить->Имя пользователя).
    '''
INFO = '''
На мемасах не должно быть водных знаков(мы и так свой херачим, куда второй то)
Бот принимает только фото или видео(до 20мб.)
Обязательно иметь username в телеграме (Настройки->Изменить->Имя пользователя).
Не больше 25 мемов в неделю.

За что можно получить бан:
За спам в предложку и ненадлежащий контент, т.е. дикпики слать не нужно.
    '''
NOT_FOUND = 'не найден'
UNBANNED = 'разбанен'
EMPTY = 'ничего не введено'
SEND_THE_LINK = 'Отправьте ссылку на рекламу'

# content.py
MODERATOR_NAME = '@wtfout'
MESSAGE_FOR_BANNED_USER = f'''Извините, но вы в бане, видимо вы запостили контент противоречащий нашим нормам морали. 
                           Если это не так и вы попали в бан ошибочно, напишите {MODERATOR_NAME}'''
LIMIT_EXCEEDED = 'Лимит мемов исчерпан. Счетчик обновится в пятницу'
POST_ACCEPTED = 'Мем принят, на этой неделе вы можете скинуть мемов:'
SEND_AD_POST = 'Отправьте рекламный пост'
AD_POST_SENT = 'Рекламный пост отправлен'
PROCESSING = '⏳'

# callback.py
LIKES_TIMEOUT = 'Время для лайков истекло'
USER_BANNED = 'Забанен пользователь: '
DELETE_FAIL = 'Нельзя удалить, удалите руками'
DELETED = 'Удалено'
POST_SOON = 'Мем скоро будет запощен'
POST_FAIL = 'Мем нихуя не запощен'
SMTH_WRONG = 'Что-то пошло не так'
